Repository: AhmedAnwarAboulezz/HrSystem_WorkShop
Catalog: Lookups.Service/Resources/Lookups.*.resx
Languages: ar_eg

# AdministrativeLevelDto_AdmLevelFL_Length
source: First Lang Not Greater Than 200 Characters
ar_eg: الاسم الاول لا يزيد عن 200 حرف

# AdministrativeLevelDto_AdmLevelSl_Length
source: Second Lang Not Greater Than 200 Characters
ar_eg: الاسم الثاني لا يزيد عن 200 حرف

# AdministrativeLevelDto_Code_Length
source: Code Not Greater Than 10 Characters
ar_eg: الكود لا يزيد عن 10 حروف

# AdministrativeLevelDto_Code_Required
source: Code is required
ar_eg: الكود مطلوب

# AllowanceDto_AllowanceFL_Length
source: First Lang Not Greater Than 200 Characters
ar_eg: الاسم الاول لا يزيد عن 200 حرف

# AllowanceDto_AllowanceSL_Length
source: Second Lang Not Greater Than 200 Characters
ar_eg: الاسم الثاني لا يزيد عن 200 حرف

# AllowanceTypeDto_AllowanceTypeFL_Length
source: First Lang Not Greater Than 200 Characters
ar_eg: الاسم الاول لا يزيد عن 200 حرف

# AllowanceTypeDto_AllowanceTypesId_Required
source: Allowance Type is required
ar_eg: نوع السماحية مطلوب

# AllowanceTypeDto_AllowanceTypeSL_Length
source: Second Lang Not Greater Than 200 Characters
ar_eg: الاسم الثاني لا يزيد عن 200 حرف

# AllowanceTypeDto_Code_Length
source: Code Not Greater Than 10 Characters
ar_eg: الكود لا يزيد عن 10 حروف

# AllowanceTypeDto_Code_Required
source: Code is required
ar_eg: الكود مطلوب

# FullDayPermissionDto_Code_Length
source: Code Not Greater Than 10 Characters
ar_eg: الكود لا يزيد عن 10 حروف

# FullDayPermissionDto_Code_Required
source: Code is required
ar_eg: الكود مطلوب

# FullDayPermissionDto_FullDayPermissionFL_Length
source: First Lang Not Greater Than 200 Characters
ar_eg: الاسم الاول لا يزيد عن 200 حرف

# FullDayPermissionDto_FullDayPermissionSL_Length
source: Second Lang Not Greater Than 200 Characters
ar_eg: الاسم الثاني لا يزيد عن 200 حرف

# HolidayDateController_IsExists
source: This Holiday Date already exist
ar_eg: الأجازة المطلوبة موجودة بالفعل

# HolidayDateController_ValidateDate
source: End Date Must be Greater Than Or Equal Start Date
ar_eg: تاريخ نهاية الاجازة لابد ان يكون اكبر من او يساوي تاريخ البداية

# HolidayDateDto_CountryID
source: Country Id is required
ar_eg: الدولة مطلوبة

# HolidayDateDto_EndDate
source: End date is required
ar_eg: تاريخ النهاية مطلوب

# HolidayDateDto_HolidayID
source: Holiday Id is required
ar_eg: الاجازة مطلوبه

# HolidayDateDto_StartDate
source: Start date is required
ar_eg: تاريخ البداية مطلوب

# HolidayDto_Code_Length
source: Code Not Greater Than 10 Characters
ar_eg: الكود لا يزيد عن 10 حروف

# HolidayDto_Code_Required
source: Code is required
ar_eg: الكود مطلوب

# HolidayDto_PublicHolidayNameFL_Length
source: First Lang Not Greater Than 200 Characters
ar_eg: الاسم الاول لا يزيد عن 200 حرف

# HolidayDto_PublicHolidayNameSL_Length
source: Second Lang Not Greater Than 200 Characters
ar_eg: الاسم الثاني لا يزيد عن 200 حرف

# JobDto_Code_Required
source: Code is required
ar_eg: الكود مطلوب

# JobsController_IsExists
source: This Job already exist
ar_eg: الوظيفة موجودة بالفعل

# FullDayPermissionService_IsExists
source: ThisFull Day Permission already exist
ar_eg: تصريح يوم كامل موجود بالفعل

# HolidayService_IsExists
source: This Holiday already exist
ar_eg: الاجازة موجودة بالفعل

# JobDegreeDto_JobDegreeFL_Length
source: First Lang Not Greater Than 200 Characters
ar_eg: الاسم الاول لا يزيد عن 200 حرف

# JobDegreeDto_JobDegreeSL_Length
source: Second Lang Not Greater Than 200 Characters
ar_eg: الاسم الثاني لا يزيد عن 200 حرف

# JobDegreeService_IsExists
source: This Job Degree already exist
ar_eg: الدرجة الوظيفية موجودة بالفعل

# JobDto_JobFL_Length
source: First Lang Not Greater Than 200 Characters
ar_eg: الاسم الاول لا يزيد عن 200 حرف

# JobDto_JobSL_Length
source: Second Lang Not Greater Than 200 Characters
ar_eg: الاسم الثاني لا يزيد عن 200 حرف

# JobService_IsExists
source: This Job already exist
ar_eg: الوظيفة موجودة بالفعل

# LateRegulationsDto_Allowance_Required
source: Allowance is required
ar_eg: السماحية مطلوبة

# LateRegulationsDto_DeductionCategoreID_Required
source: Deduction Categore is required
ar_eg: نوع الخصم مطلوب

# LateRegulationsDto_EndDate_Required
source: End date is required
ar_eg: تاريخ النهاية مطلوب

# LateRegulationsDto_LateRegulationFL_Length
source: First Lang Not Greater Than 200 Characters
ar_eg: الاسم الاول لا يزيد عن 200 حرف

# LateRegulationsDto_LateRegulationSL_Length
source: Second Lang Not Greater Than 200 Characters
ar_eg: الاسم الثاني لا يزيد عن 200 حرف

# LateRegulationsDto_StartDate_Required
source: Start date is required
ar_eg: تاريخ البداية مطلوب

# LateRegulationService_IsExists
source: This Late Regulation already exist
ar_eg: مجموعة رصيد التأخيرات موجودة بالفعل

# LateRegulationService_ValidateDate
source: End Date Must be Greater Than Or Equal Start Date
ar_eg: تاريخ النهاية لابد ان يكون اكبر من او يساوي تاريخ البداية

# NationalityDto_Code_Required
source: Code is required
ar_eg: الكود مطلوب

# NationalityDto_NationalityFl_Length
source: First Lang Not Greater Than 200 Characters
ar_eg: الاسم الاول لا يزيد عن 200 حرف

# NationalityDto_NationalitySl_Length
source: Second Lang Not Greater Than 200 Characters
ar_eg: الاسم الثاني لا يزيد عن 200 حرف

# NationalityService_IsExists
source: This Nationality already exist
ar_eg: الجنسية موجودة بالفعل

# Administrative_LevelsService_IsExists
source: This Administrative Level already exist
ar_eg: المستوي الاداري موجودة بالفعل

# AllowanceService_IsExists
source: This Allowance already exist
ar_eg: السماحيةموجودة بالفعل

# AttachmentsTypeDto_NameFl_Length
source: First Lang Not Greater Than 50 Characters
ar_eg: الاسم الاول لا يزيد عن 50 حرف

# AttachmentsTypeDto_NameSl_Length
source: Second Lang Not Greater Than 50 Characters
ar_eg: الاسم الثاني لا يزيد عن 50 حرف

# ContractTypeDto_ContractTypeFL_Length
source: First Lang Not Greater Than 200 Characters
ar_eg: الاسم الاول لا يزيد عن 200 حرف

# ContractTypeDto_ContractTypeSL_Length
source: Second Lang Not Greater Than 200 Characters
ar_eg: الاسم الثاني لا يزيد عن 200 حرف

# ContractTypeService_IsExists
source: This Contract Type already exist
ar_eg: نوع العقد موجودة بالفعل

# CountryService_IsExists
source: This Country already exist
ar_eg: الدولة موجودة بالفعل

# LeavesTypesDto_Code_Length
source: Code Not Greater Than 10 Characters
ar_eg: الكود لا يزيد عن 10 حروف

# LeavesTypesDto_Code_Required
source: Code is required
ar_eg: الكود مطلوب

# LeavesTypesDto_LeaveTypeFL_Length
source: First Lang Not Greater Than 200 Characters
ar_eg: الاسم الاول لا يزيد عن 200 حرف

# LeavesTypesDto_LeaveTypeSL_Length
source: Second Lang Not Greater Than 200 Characters
ar_eg: الاسم الثاني لا يزيد عن 200 حرف

# LeavesTypesService_IsExists
source: This Leave Type already exist
ar_eg: يوجد نوع اجازه بهذا الاسم بالفعل

# LocationDto_Code_Length
source: Code Not Greater Than 10 Characters
ar_eg: الكود لا يزيد عن 10 حروف

# LocationDto_Code_Required
source: Code is required
ar_eg: الكود مطلوب

# LocationDto_CountryId_Required
source: Country is required
ar_eg: الدولة مطلوب

# LocationDto_LocationFL_Length
source: First Lang Not Greater Than 200 Characters
ar_eg: الاسم الاول لا يزيد عن 200 حرف

# LocationDto_LocationSL_Length
source: Second Lang Not Greater Than 200 Characters
ar_eg: الاسم الثاني لا يزيد عن 200 حرف

# LocationService_IsExists
source: This Location already exist
ar_eg: الموقع موجود بالفعل

# OverTimeDateDto_EndDate_Required
source: End Date is required
ar_eg: تاريخ النهاية مطلوب

# OverTimeDateDto_Rate_Required
source: Rate is required
ar_eg: المعدل مطلوب

# OverTimeDateDto_StartDate_Required
source: Start Date is required
ar_eg: تاريخ البداية مطلوب

# OverTimeDateService_IsExists
source: This Over Time already exist
ar_eg: الوقت الاضافي موجود بالفعل

# OverTimeDateService_ValidateDate
source: End Date Must be Greater Than Or Equal Start Date
ar_eg: تاريخ النهاية لابد ان يكون اكبر من او يساوي تاريخ البداية

# PartialPermissionTypeDto_Code_Length
source: Code Not Greater Than 6 Characters
ar_eg: الكود لا يزيد عن 6 حروف

# PartialPermissionTypeDto_Code_Required
source: Code is required
ar_eg: الكود مطلوب

# PartialPermissionTypeDto_CountryId_Required
source: Country is required
ar_eg: الدولة مطلوب

# PartialPermissionTypeDto_PartialPermissionFL_Length
source: First Lang Not Greater Than 200 Characters
ar_eg: الاسم الاول لا يزيد عن 200 حرف

# PartialPermissionTypeDto_PartialPermissionSL_Length
source: Second Lang Not Greater Than 200 Characters
ar_eg: الاسم الثاني لا يزيد عن 200 حرف

# QualificationDto_QualificationTypeFl_Length
source: First Lang Not Greater Than 200 Characters
ar_eg: الاسم الاول لا يزيد عن 200 حرف

# QualificationDto_QualificationTypeSl_Length
source: Second Lang Not Greater Than 200 Characters
ar_eg: الاسم الثاني لا يزيد عن 200 حرف

# QualificationService_IsExists
source: This Qualification already exist
ar_eg: المؤهل موجودة بالفعل

# ReligionDto_Code_Length
source: Code Not Greater Than 10 Characters
ar_eg: الكود لا يزيد عن 10 حروف

# ReligionDto_Code_Required
source: Code is required
ar_eg: الكود مطلوب

# ReligionDto_DescriptionFl_Length
source: First Lang Not Greater Than 200 Characters
ar_eg: الاسم الاول لا يزيد عن 200 حرف

# ReligionDto_DescriptionSl_Length
source: Second Lang Not Greater Than 200 Characters
ar_eg: الاسم الثاني لا يزيد عن 200 حرف

# ReligionService_IsExists
source: This Religion already exist
ar_eg: الديانة موجودة بالفعل

# TeamDto_TeamFl_Length
source: First Lang Not Greater Than 200 Characters
ar_eg: الاسم الاول لا يزيد عن 200 حرف

# TeamDto_TeamSl_Length
source: Second Lang Not Greater Than 200 Characters
ar_eg: الاسم الثاني لا يزيد عن 200 حرف

# TeamService_IsExists
source: This Team already exist
ar_eg: الفريق موجود بالفعل

# DateBetweenStartandEnd
source: this allowance Date exist
ar_eg: هذه الفتره موجوده بالفعل في هذه السماحيه

# LeaveRegulation_IsExist
source: This LeaveRegulation already exist
ar_eg: توجد لائحة بهذا الاسم بالفعل

# HolidayDateIsExists
source: This Holiday Date Duration for the country is already exist before
ar_eg: توقيت الأجازة المدخلة لنفس نوع الأجازة والبلد موجود مسبقاً

# LateRegulationService_AllEmployeesIsExists
source: Late Regulation Already Exist For All Employees Type In This Period Before
ar_eg: هناك لائحة تأخيرات بالفعل لكل الموظفين فى تلك الفترة

# LateRegulationService_ContractsIsExists
source: Late Regulation Already Exist For One Of Those Contracts In This Period Before
ar_eg: هناك لائحة تأخيرات بالفعل مرتبطة بأحد العقود المستخدمة فى تلك الفترة

# LateRegulationService_OldEmployeesIsExists
source: Late Regulation Already Exist For Old Employees Type In This Period Before
ar_eg: هناك لائحة تأخيرات بالفعل لقدامى الموظفين فى تلك الفترة

# LengthOfServiceGreaterThan
source: End Of Service Year Should Be Greater Than Start Of Service
ar_eg: نهاية سنوات الخدمة يجب أن تكون أكبر من بداية سنوات الخدمة

# LateRegulationDeductionDto_DeductionCategoryId_Required
source: Deduction Category Is Required
ar_eg: يجب أختيار فئة الخصم

# LateRegulationDeductionDto_DeductionUnitId_Required
source: Deduction Unit Is Required
ar_eg: يجب أختيار وحدة الخصم

# LateRegulationService_ContractTypeIsRequired
source: You Should Choose Contract First
ar_eg: يجب أختيار العقد أولا

# LateRegulationService_DeductionIsRequired
source: You Should Choose Deduction Categories First
ar_eg: يجب أختيار نوع الخصم

# LateRegulationService_LengthOfServiceIsRequired
source: Length Of Service Is Required
ar_eg: يجب أختيار مدة الخدمة

# Adminstrative_CannotDelete
source: This adminstrative has employees!
ar_eg: الادارة مربوط بها موظفين!

# Administrative_LevelsService_Assign_To_Itself
source: This Administrative Level couldn't assign to itself or its childrens
ar_eg: لا يمكنك ربط المستوى الإداري بنفسه أو بأحد فروعه

# OverTimeDateService_MorningNightTimeIntersect
source: Morning and night can not intersect with each other
ar_eg: فترة الصباح وفترة المساء لايمكن ان يتقاطعا

# Overtime_Regulation_IsExists
source: Overtime Regulation Already Exist In This Period Before
ar_eg: هناك لائحة وقت اضافي بالفعل فى تلك الفترة

# DeviceService_IsExists
source: Terminal IP Already Exist
ar_eg: رقم الجهاز موجود مسبقاً

# Organization_Late_Regulation_IsExists
source: Late Regulation Already Exist In This Period Before
ar_eg: هناك لائحة تأخيرات بالفعل فى تلك الفترة

# Absences_Regulation_IsExists
source: Absences Regulation Already Exist In This Period Before
ar_eg: هناك لائحة غيابات بالفعل فى تلك الفترة

# cant_Delete_Default
source: Can't Delete Default Regulation
ar_eg: لا يمكن حذف اللائحة الاساسية

# Administrative_Has_Manager
source: Can't Delete Administration With Manager
ar_eg: لا يمكن حذف إدارة لها مدير
